In [1]:
import numpy as np
import pandas as pd
url="C:\\Users\\bathejah\\Documents\\Python\\pandaread.csv"
url2="C:\\Users\\bathejah\\Documents\\Python\\pandaread2.csv"

In [10]:
df1=pd.read_csv("C:\\Users\\bathejah\\Documents\\Python\\pandaread.csv")
df1

   Index  Name      ph
0      1   sdf      34
1      2   dfg      45
2      3   dfg    4554
3      4  adfb     454
4      5  adfb    6767
5      6   dsg   32423
6      7   sdf      45
7      8   DFB  423423

In [6]:
pd.read_csv("C:\\Users\\bathejah\\Documents\\Python\\pandaread.csv",usecols=["Name"])

   Name
0   sdf
1   dfg
2   dfg
3  adfb
4  adfb
5   dsg
6   sdf
7   DFB

In [7]:
pd.read_csv("C:\\Users\\bathejah\\Documents\\Python\\pandaread.csv",header=4)

   4  adfb     454
0  5  adfb    6767
1  6   dsg   32423
2  7   sdf      45
3  8   DFB  423423

In [12]:
df1['Name']

0     sdf
1     dfg
2     dfg
3    adfb
4    adfb
5     dsg
6     sdf
7     DFB
Name: Name, dtype: object

In [ ]:
lst=[1,2,3,4,'a',2.0,"f"]
print(lst)
df = pd.DataFrame(lst)
print(df)

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [17]:
df=pd.DataFrame(['a','b','c'])
print(df)

   0
0  a
1  b
2  c

In [29]:
lst1=['a',2.0,"f"]
df = pd.DataFrame(lst1,index=[1,2,4])

In [30]:
print(df)

     0
1    a
2  2.0
4    f

In [31]:
df=pd.DataFrame(np.random.randn(4,4),index=[6,7,8,9],columns=['col1','col2','col3','col4'])
print(df)

       col1      col2      col3      col4
6  0.042445 -1.838837  0.030291  0.577525
7 -0.156096  1.047171  0.620872 -1.515409
8 -1.595346 -0.544604 -0.451414  0.073658
9 -0.260722 -1.252339  1.835730  0.822140

In [32]:
df = pd.DataFrame(['a','b','c'], index=['r','t','u'])
print(df)

   0
r  a
t  b
u  c

In [33]:
for x,n in df.iteritems():
    print(x,n)

0 r    a
t    b
u    c
Name: 0, dtype: object

In [34]:
for row_index,row in df.iteritems():
    print(row_index,row)

0 r    a
t    b
u    c
Name: 0, dtype: object

In [35]:
for row_index,row in df.iterrows():
    print(row_index,row)

r 0    a
Name: r, dtype: object
t 0    b
Name: t, dtype: object
u 0    c
Name: u, dtype: object

In [36]:
for row in df.itertuples():
    print(row)

Pandas(Index='r', _1='a')
Pandas(Index='t', _1='b')
Pandas(Index='u', _1='c')

In [23]:
B={'A':['a','b','c'],'B':[1,2,3],'C':[2014,2015,2016],'D':['AA','BB','yy']}
print(B)

{'A': ['a', 'b', 'c'], 'B': [1, 2, 3], 'C': [2014, 2015, 2016], 'D': ['AA', 'BB', 'yy']}

In [24]:
df2=pd.DataFrame(B)
print(df2)

   A  B     C   D
0  a  1  2014  AA
1  b  2  2015  BB
2  c  3  2016  yy

In [27]:
df3=pd.DataFrame(B,index=[1,2,4])
df3

   A  B     C   D
1  a  1  2014  AA
2  b  2  2015  BB
4  c  3  2016  yy

In [28]:
lstdict=[{'A': ['a', 'b', 'c'], 'B': [1, 2, 3], 'C': ['AA', 'BB', 'yy']}]
data=[{'a':['a','b','c']},{'a':5,'b':10,'c':20},{'a':11,'h':1,'g':6}]
df=pd.DataFrame(data,index=['first','second','third'])
print(df)

                a     b     c    h    g
first   [a, b, c]   NaN   NaN  NaN  NaN
second          5  10.0  20.0  NaN  NaN
third          11   NaN   NaN  1.0  6.0

In [39]:
lst1=[[1,2,3],['a','b','c']]
df4 = pd.DataFrame(lst1,index=['m','n'],dtype=float)
print(df4)

   0  1  2
m  1  2  3
n  a  b  c

C:\Users\bathejah\AppData\Local\Temp\ipykernel_11376\3474642403.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df4 = pd.DataFrame(lst1,index=['m','n'],dtype=float)

In [3]:
lst1=[['a','b','c'],[1,2,3]]
df4 = pd.DataFrame(lst1,index=['m','n'],dtype=float)
print(df4)

   0  1  2
m  a  b  c
n  1  2  3

C:\Users\bathejah\AppData\Local\Temp\ipykernel_2096\2673114632.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df4 = pd.DataFrame(lst1,index=['m','n'],dtype=float)

In [11]:
lst1=[['a','b','c'],[1,2,3]]
# df4 = pd.DataFrame(lst1,index=['m','n'],columns=['A','B'],dtype=float)
df4 = pd.DataFrame(lst1,index=['m','n'],columns=['A','B','C'],dtype=float)
print(df4)

   A  B  C
m  a  b  c
n  1  2  3

C:\Users\bathejah\AppData\Local\Temp\ipykernel_2096\3319235055.py:3: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df4 = pd.DataFrame(lst1,index=['m','n'],columns=['A','B','C'],dtype=float)

In [13]:
data=[['Alex',10],['Bob',12],['Clarke',13]]
df4 = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df4)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [14]:
# data=[['Alex',10],['Bob',12],['Clarke',13]]
df4 = pd.DataFrame(data,columns=['Name','Age'],index=[5,6,7],dtype=float)
print(df4)

     Name   Age
5    Alex  10.0
6     Bob  12.0
7  Clarke  13.0

C:\Users\bathejah\AppData\Local\Temp\ipykernel_2096\693689270.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df4 = pd.DataFrame(data,columns=['Name','Age'],index=[5,6,7],dtype=float)

In [15]:
data=[['Alex',10,100],['Bob',12,500],['Clarke',13,1000]]
df4 = pd.DataFrame(data,columns=['Name','Age','New'],index=[5,6,7],dtype=float)
print(df4)

     Name   Age     New
5    Alex  10.0   100.0
6     Bob  12.0   500.0
7  Clarke  13.0  1000.0

C:\Users\bathejah\AppData\Local\Temp\ipykernel_2096\11606726.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df4 = pd.DataFrame(data,columns=['Name','Age','New'],index=[5,6,7],dtype=float)

In [42]:
location=pd.DataFrame({'Area':['new-york','columbo','mumbai']})
food=pd.DataFrame({'Food':['pizza','crabs','vada-paw']})
det=pd.concat([location,food],join='outer',axis=1)
print(det)

       Area      Food
0  new-york     pizza
1   columbo     crabs
2    mumbai  vada-paw

In [51]:
engg=pd.read_csv("pandaread.csv")
df2=pd.read_csv("pandaread2.csv")
# det=pd.merge([engg,df2],how='left')
det=pd.concat([engg,df2],join='inner',axis=0)
det

   Index  Name
0      0  wdgv
1      1   edv
2      2    fb
3      3  adfb
4      4  adfb
5      5   dsg
6      6   sdf
7      7   DFB
0      1  wdgv
1      2   edv
2      3    fb
3      4    eb
4      5  qtvb
5      6   qfb
6      7    ev
7      8   qev

In [5]:
engg=pd.read_csv("pandaread.csv")
df2=pd.read_csv("pandaread2.csv")

det=df2.merge(engg,how='left',on='phone')
# det=df2.merge(engg,how='right',on='phone')
det

   Index_x Name_x    ph  phone  Index_y Name_y
0        1   wdgv    65     65      0.0   wdgv
1        2    edv     5      5      1.0    edv
2        3     fb   123    123      2.0     fb
3        4     eb    98   5161      NaN    NaN
4        5   qtvb  9321   5616      NaN    NaN
5        6    qfb    15     16      NaN    NaN
6        7     ev   651    616      NaN    NaN
7        8    qev    32     16      NaN    NaN

In [6]:
titanic = pd.read_csv("titanicnew.csv")
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
titanic.shape

(1310, 14)

In [10]:
titanic.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [12]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [13]:
titanic[0:10]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [14]:
titanic.iloc[0:10,1:5]

   survived                                             name     sex      age
0       1.0                    Allen, Miss. Elisabeth Walton  female  29.0000
1       1.0                   Allison, Master. Hudson Trevor    male   0.9167
2       0.0                     Allison, Miss. Helen Loraine  female   2.0000
3       0.0             Allison, Mr. Hudson Joshua Creighton    male  30.0000
4       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000
5       1.0                              Anderson, Mr. Harry    male  48.0000
6       1.0                Andrews, Miss. Kornelia Theodosia  female  63.0000
7       0.0                           Andrews, Mr. Thomas Jr    male  39.0000
8       1.0    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female  53.0000
9       0.0                          Artagaveytia, Mr. Ramon    male  71.0000

In [19]:
titanic['name'][0:10]

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5                                Anderson, Mr. Harry
6                  Andrews, Miss. Kornelia Theodosia
7                             Andrews, Mr. Thomas Jr
8      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                            Artagaveytia, Mr. Ramon
Name: name, dtype: object

In [20]:
pd.isnull(titanic["name"])

0       False
1       False
2       False
3       False
4       False
        ...
1305    False
1306    False
1307    False
1308    False
1309     True
Name: name, Length: 1310, dtype: bool

In [21]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [29]:
# titanic.to_excel("newtitanic.xlsx")
# titanic.to_string("newtitanic.txt")

In [31]:
# titanic['sex'].upper()